// 在院状态
export const hosStatus = {
  '0': '不在院',
  '1': '在院',
}
// 参保状态
export const medicalStatus = {
  '0': '未参保',
  '1': '参保'
}
// 医疗辅助险种参保情况
export const aidMedicalType = ['大额', '公务员', '照顾费']
// 医疗主险参保情况
export const mainInsruance = ['基本医疗', '离休', '二乙', '城镇居民']
// 照顾类别
export const careType = {
  '0': '非保健对象',
  '1': '企业一级保健对象',
  '2': '企业二级保健对象',
  '3': '企业三级保健对象',
  '4': '机关一级保健对象',
  '5': '机关二级保健对象',
  '6': '机关三级保健对象',
}
// 人员状态
export const personStatus = {
  '0': '未就业',
  '1': '在职',
  '2': '退休',
  '3': '离休',
  '4': '终止',
  '7': '城镇居民',
}
// 医疗人员类别
export const personType = {
  '11': '在职',
  '21': '退休',
  '31': '离休',
  '32': '二等乙军人',
  '33': '二等乙警察',
  '35': '离休家属',
  '36': '建国前老工人',
  '711': '普通儿童',
  '712': '低保儿童',
  '713': '重度残疾儿童',
  '721': '中小学生',
  '722': '低保中小学生',
  '723': '重度残疾中小学生',
  '731': '普通大学生',
  '741': '普通成年人',
  '742': '低保成年人',
  '743': '丧失劳动能力重度残疾成年人',
  '744': '持证贫困残疾成年人',
  '751': '60周岁以上老年人',
}
// 单位类型
export const unitType = {
  '50': '民办非企业单位',
  '43': '自收自支社会团体',
  '42': '差额拨款社会团体',
  '41': '全额拨款社会团体',
  '70': '再就业服务中心',
  '80': '灵活社会化单位',
  '82': '城镇居民学校虚拟',
  '81': '城镇居民社区虚拟',
  '22': '差额拨款事业单位',
  '11': '破产企业',
  '21': '全额拨款事业单位',
  '23': '自收自支事业单位',
  '10': '企业',
  '30': '机关',
  '60': '城镇个体工商户',
  '40': '社会团体',
  '90': '其它',
  '13': '军转企业',
  '12': '改制企业',
}
// 医疗类别
export const medicalType = [{
  id: '11', name: '普通门诊'
},
{
  id: '12', name: '药店购药'
},
{
  id: '13', name: '门诊慢性病'
},
{
  id: '14', name: '门诊大病'
},
{
  id: '15', name: '特检特治门诊'
},
{
  id: '18', name: '意外伤害门诊'
},
{
  id: '19', name: '门诊城镇居民体检'
},
{
  id: '21', name: '普通住院'
},
{
  id: '23', name: '转外诊治'
},
{
  id: '25', name: '普通住院(精神病长期住院)'
},
{
  id: '27', name: '离休转外诊治住院'
},
{
  id: '31', name: '转外门诊慢性病'
},
{
  id: '32', name: '转外门诊大病'
},
{
  id: '33', name: '转外特检特治门诊'
},
{
  id: '34', name: '转外意外伤害门诊'
},
{
  id: '35', name: '转外普通门诊'
},
{
  id: '38', name: '离休转外急诊急救'
},
{
  id: '41', name: '工伤门诊'
},
{
  id: '42', name: '工伤住院'
},
{
  id: '51', name: '生育门诊'
},
{
  id: '52', name: '生育住院'
},
{
  id: '53', name: '生育新生儿'
},
{
  id: '55', name: '城镇女居民生育'
}]

export const cfMedicalType = [
  { id: '21', name: '普通住院' },
  { id: '25', name: '门诊住院' }
]
// 入院原因
export const inReason = [
  { id: '0', name: '普通入院' },
  { id: '1', name: '转入入院' }
]
// 出院原因
export const outReason = [
  { id: '0', name: '正常治愈出院' },
  { id: '1', name: '未治愈出院' },
  { id: '2', name: '医院要求转院' },
  { id: '3', name: '病人要求转院' },
  { id: '4', name: '院内相关疾病转科治疗' },
  { id: '5', name: '院内无关疾病专科治疗' },
  { id: '6', name: '死亡' }]
// 项目类别
export const itemType = {
  '1': '药品',
  '2': '诊疗项目',
  '3': '服务设施',
}
