// 医保卡交易类型
export const tradeType = [{
  id: '1',
  name: '登记'
},
{
  id: '2',
  name: '修改'
},
{
  id: '3',
  name: '出院登记'
},
{
  id: '-1',
  name: '无费退院/退号'
}]
// 住院医疗类别
export const medicalType = [{
  id: '21',
  name: '普通住院'
}, {
  id: '25',
  name: '住院急诊'
}]
// 出院状态
export const dischargeStatus = [{
  id: 2,
  name: '治愈'
},
{
  id: 3,
  name: '好转'
},
{
  id: 4,
  name: '未愈'
},
{
  id: 5,
  name: '正常死亡'
},
{
  id: 1,
  name: '急诊死亡'
},
{
  id: 6,
  name: '正常产'
},
{
  id: 7,
  name: '非正常产'
},
{
  id: 8,
  name: '人工流产'
},
{
  id: 9,
  name: '其他'
}]
// 医疗人员类别
export const personType = {
  '11': '在职',
  '12': '在职长期驻外',
  '21': '退休',
  '22': '退休异地安置',
  '31': '离休',
  '32': '老红军',
  '33': '二等乙级伤残军人',
  '34': '特殊全免人员',
  '35': '建国前',
  '36': '新离休人员',
  '41': '建国前老工人',
  '51': '停薪留职人员',
  '61': '下岗人员',
  '71': '城区居民',
  '72': '低保人员',
  '73': '劳动模范',
  '74': '中小学生',
  '75': '贫困残疾人',
  '76': '外来务工',
  '77': '征地农民',
  '78': '城镇4050灵活就业人员',
  '79': '城镇灵活就业人员',
  '81': '终止人员',
  '91': '其他人员',
  '92': '农合',
}
// 在院状态
export const hosStatus = {
  '0': '不在院',
  '1': '入院登记',
  '3': '出院登记',
  '4': '已经结算',
  '6': '无费退院'
}
// 统筹区域
export const overallArea = {
  '220101': '长春市医保',
  '220102': '一汽医保',
  '220112': '双阳市',
  '220181': '九台市',
  '220122': '农安',
  '220182': '榆树市医保',
  '220183': '德惠',
  '220104': '朝阳区农合',
}
// 参保状态
export const medicalStatus = {
  '01': '正常',
  '02': '暂停',
  '03': '注销',
  '04': '终止'
}
// 全部医疗类别
export const treatType = {
  '11': '普通门诊',
  '16': '急诊门诊',
  '21': '普通住院',
  '25': '住院急诊'
}
// 结算状态
export const settleStatus = {
  '0': '未结算',
  '1': '已结算',
  '2': '不平账',
  '3': '中途结算'
}
// 支付状态
export const payStatus = {
  '0': '未支付',
  '1': '已支付'
}
// 发票类型
export const invoiceType = {
  '0': '门诊发票',
  '1': '住院发票'
}
// 医保上传状态
export const uploadStatus = {
  '0': '临时',
  '1': '上传',
  '2': '撤销'
}
// 医保上传交易类型
export const uploadTradeType = {
  '-1': '退费',
  '1': '收费'
}
// 医保收费等级
export const medicalChargeLevel = {
  '1': '甲类',
  '2': '乙类',
  '3': '丙类',
  '4': '离休专用'
}
// 医保结算交易类型
export const medSettleTradeType = {
  '0': '结算',
  '1': '预结',
  '-2': '退费',
  '-3': '清方退费(需重新上传处方)',
}
// 对照状态
export const tyUploadStatus = [
  { id: '0', name: '未上传' },
  { id: '1', name: '上传成功' },
  { id: '2', name: '上传失败' },
  { id: '3', name: '已更新' }
]
// 长峰对照状态
export const cfUploadStatus = [
  { id: '0', name: '未对照' },
  { id: '1', name: '已对照' }
]
