// 医疗统筹类别
// 0为仅，1为住院，4为门诊大病(特病) ，6为普通门诊
export const yltclb = [{
  id: '0',
  name: '获取人员基本信息'
},
{
  id: '1',
  name: '住院'
},
{
  id: '2',
  name: '长期护理'
},
{
  id: '4',
  name: '门诊大病（特病）'
},
{
  id: '5',
  name: '(学生)意外伤害'
},
{
  id: '6',
  name: '普通门诊'
}]

// 门诊对账门诊类别
export const mzlbOptions = [
  { id: '1', name: '全部' },
  { id: '2', name: '门诊慢性病' },
  { id: '3', name: '普通门诊统筹' },
  { id: '4', name: '普通门诊个账' }
]
// 险种标志
export const insuranceType = {
  'C': '医疗',
  'D': '工伤',
  'E': '生育'
}
// 结算标志
export const settleFlag = {
  '0': '已撤销',
  '1': '未撤销'
}
// 慢病病人用药情况,查询类别
export const mbyyqkQueryType = [{
  id: '0', name: '只查询上一次'
},
{
  id: '1', name: '按日期查询'
}]
// 读卡灰名单标志
export const whiteOrBlack = {
  '0': '灰名单',
  '1': '白名单'
}
// 读卡异地标志
export const yidiFlag = {
  '1': '异地', '0': '不是异地'
}
// 贫困人口标志
export const isPoor = {
  '1': '贫困人口', '0': '非贫困人口'
}
// 人群类别
export const peopleType = {
  'A': '职工',
  'B': '居民'
}
// 救助人员类别
export const savePersonType = {
  '001': '低保人员',
  '002': '城镇孤儿',
  '003': '三无人员',
  '004': '重点优抚',
  '005': '特困人员',
  '006': '五保人员',
  '999': '普通人群'
}

// 医师状态
export const docType = {
  '0': '未审批',
  '1': '正常',
  '2': '注销',
  '3': '暂停'
}

// 执业医师执业范围
export const doczyfw = {
  '01': '内科',
  '02': '外科',
  '03': '妇产科',
  '04': '儿科',
  '05': '眼耳鼻咽喉科',
  '06': '皮肤病与性病',
  '07': '精神卫生',
  '08': '职业病',
  '09': '医学影像和放射治疗',
  '10': '医学检验与病理',
  '11': '全科医学',
  '12': '急救医学',
  '13': '康复医学',
  '14': '预防保健',
  '15': '特种医学与军事医学',
  '16': '计划生育技术服务',
  '21': '中医专业',
  '22': '中西医结合专业',
  '23': '蒙医专业',
  '24': '藏医专业',
  '25': '维医专业',
  '26': '傣医专业',
  '31': '口腔专业',
  '41': '公共卫生类别专业',
  '42': '省级以上卫生行政部门规定的其他专业'
}
// 医师执业类别
export const doczylb = {
  '01': '临床',
  '02': '中医',
  '03': '民族医',
  '04': '中西医结合',
  '05': '口腔',
  '06': '公共卫生'
}

// 各种字典编号
export const xzbzCode = 'XZBZ' // 险种标志
export const yltclbCode = 'YLTCLB' // 医疗统筹类别

